# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Flávio Martins

### Grupo 21
<dl>
    <dt>16 horas (33%)</dt>
    <dd>ist1100293 Carlos Felgueiras</dd>
    <dt>16 horas (34%)</dt>
    <dd>ist1102556 Daniel Carvalho</dd>
    <dt>16 horas (33%)</dt>
    <dd>ist1102597 Duarte Sousa</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- Employee (<u>ssn</u>, TIN,  bdate, name)
    - unique(TIN)
- Department (<u>name</u>)
- Workplace (<u>address</u>, lat, long)
    - unique(lat, long)
- Office (<u>address</u>)
    - address: FK (Workplace)
- Warehouse (<u>address</u>)
    - address: FK (Workplace)
- Customer (<u>customer_number</u>, name, email, phone, address)
    - unique(email)
- Order (<u>order_number</u>, customer_number, date)
    - customer_number: FK (Customer) not null
- Sale (<u>order_number</u>)
    - order_number: FK (Order)
- Product (<u>sku</u>, name, description, price, ean)
    - (price > 0)
- Supplier (<u>tin</u>, sku, address, name, date)
    - sku: FK (Product) not null

- works (<u>ssn</u>, <u>name</u>, <u>address</u>)
    - ssn: FK (Employee)
    - name: FK (Department)
    - address: FK (Workplace)
- process (<u>ssn</u>, <u>order_number</u>)
    - ssn: FK (Employee)
    - order_number: FK (Order)
- pay (<u>customer_number</u>, <u>order_number</u>)
    - customer_number: FK (Customer)
    - order_number: FK (Sale)
    - unique(order_number)
- contains (<u>order_number</u>, <u>sku</u>, qty)
    - order_number: FK (Order)
    - sku: FK (Product)
    - (qty > 0)
- delivery (<u>address</u>, <u>tin</u>)
    - address: FK (Warehouse)
    - tin: FK (Supplier)

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

- RI-1: Todo o ssn em Employee tem de estar presente em works.
- RI-2: Todo o par (customer_number, order_number) em pay tem de estar presente em Order.
- RI-3: Todo o orderNo em Order tem de estar presente em contains.
- RI-4: Todo o sku em Product tem de estar presente em Supplier.

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{\text{c.name}} \big(\text{Customer} \bowtie_{\text{c.customer_number} = \text{o.customer_number}}\rho_{o}(\sigma_{\text{date} \ge \text{"01-01-2023"} \wedge \text{date} \le \text{"31-12-2023"}} (\text{Order})\bowtie \text{contains} \bowtie \sigma_{\text{price} > 50} (\text{Product})) \big)$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$R \leftarrow \text{Employee} \bowtie_{\text{e.ssn} = \text{w.ssn}} \text{works} \bowtie \text{Workplace}$

$\Pi_{\text{e.name}}\big(((R \bowtie \text{Warehouse}) - (R \bowtie \text{Office})) \bowtie \text{process} \bowtie \sigma_{\text{date} \ge \text{"01-01-2023"} \wedge \text{date} \le \text{"31-01-2023"}} (\text{Order}) \big)$

3. Indique o nome do produto mais vendido;

$R \leftarrow {}_{\text{sku}}G_{\text{sum(qty)} \rightarrow \text{total}}(\text{Sale} \bowtie \text{Order} \bowtie \text{contains})$

$\Pi_{\text{name}} \big(G_{\text{max(total)} \rightarrow \text{total}}R \bowtie R \bowtie \text{Product} \big)$

4. Indique o valor total de cada venda realizada.

${}_{\text{orderNo}}G_{\text{sum(sub_total)} \rightarrow \text{total}} \rho_{2 \rightarrow \text{sub_total}}\Pi_{\text{orderNo, qty*price}}  \big(\text{Sale} \bowtie \text{Order} \bowtie \text{contains} \bowtie \text{Product} \big)$

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [5]:
%load_ext sql
%sql postgresql://db:db@postgres/db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [349]:
%%sql
-- Visto que 'order' é uma keyword em SQL, decidimos renomear a relação Order para package.

-- schema.sql
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS package CASCADE;
DROP TABLE IF EXISTS sale CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;

-- RI-1: Todo o ssn em employee tem de estar presente em works.
CREATE TABLE employee
(
    ssn NUMERIC(12),
    tin NUMERIC(12) UNIQUE NOT NULL,
    bdate DATE NOT NULL,
    name VARCHAR(80) NOT NULL,
    PRIMARY KEY(ssn)
);

CREATE TABLE department
(
    name VARCHAR(80),
    PRIMARY KEY(name)
);

CREATE TABLE workplace
(
    address VARCHAR(300),
    gps_lat DOUBLE PRECISION,
    gps_long DOUBLE PRECISION,
    UNIQUE (gps_lat, gps_long),
    PRIMARY KEY(address)
);

CREATE TABLE office
(
    address VARCHAR(300),
    PRIMARY KEY(address),
    FOREIGN KEY(address) REFERENCES workplace
);

CREATE TABLE warehouse
(
    address VARCHAR(300),
    PRIMARY KEY(address),
    FOREIGN KEY(address) REFERENCES workplace
);

CREATE TABLE customer
(
    customer_number SERIAL,
    name VARCHAR(80),
    email VARCHAR(50) UNIQUE,
    phone_number VARCHAR(20),
    address VARCHAR(300),
    PRIMARY KEY(customer_number)
);

-- RI-2: Todo o par (customer_number, order_number) em pay tem de estar presente em package.
-- RI-3: Todo o orderNo em package tem de estar presente em contains.
CREATE TABLE package
(
    order_number BIGSERIAL,
    customer_number INT NOT NULL REFERENCES customer,
    order_date DATE,
    PRIMARY KEY(order_number)
);

CREATE TABLE sale
(
    order_number BIGINT,
    PRIMARY KEY(order_number),
    FOREIGN KEY(order_number) REFERENCES package
);

-- RI-4: Todo o sku em product tem de estar presente em supplier.
CREATE TABLE product
(
    sku VARCHAR(20),
    name VARCHAR(80),
    description VARCHAR(1000),
    price DECIMAL,
    ean NUMERIC(13),
    PRIMARY KEY(sku),
    CONSTRAINT price_positive CHECK (price > 0)
);

-- RI-4: Todo o sku em product tem de estar presente em supplier.
CREATE TABLE supplier
(
    tin NUMERIC(12),
    sku VARCHAR(20) NOT NULL,
    address VARCHAR(300),
    name VARCHAR(80),
    contract_date DATE NOT NULL,
    PRIMARY KEY(tin),
    FOREIGN KEY(sku) REFERENCES product
);

-- RI-1: Todo o ssn em Employee tem de estar presente em works.
CREATE TABLE works
(
    ssn NUMERIC(12) NOT NULL,
    department_name VARCHAR(80) NOT NULL,
    address VARCHAR(300) NOT NULL,
    PRIMARY KEY(ssn, department_name, address),
    FOREIGN KEY(ssn) REFERENCES employee,
    FOREIGN KEY(department_name) REFERENCES department(name),
    FOREIGN KEY(address) REFERENCES workplace(address)
);

CREATE TABLE process
(
    ssn NUMERIC(12) NOT NULL,
    order_number BIGINT NOT NULL,
    PRIMARY KEY(ssn, order_number),
    FOREIGN KEY(ssn) REFERENCES employee(ssn),
    FOREIGN KEY(order_number) REFERENCES package
);

-- RI-2: Todo o par (custNo, orderNo) em pay tem de estar presente em Order.
CREATE TABLE pay
(
    customer_number INT NOT NULL,
    order_number BIGINT UNIQUE NOT NULL,
    PRIMARY KEY(customer_number, order_number),
    FOREIGN KEY(customer_number) REFERENCES customer,
    FOREIGN KEY(order_number) REFERENCES sale
);

-- RI-3: Todo o orderNo em package tem de estar presente em contains.
CREATE TABLE contains
(
    order_number BIGINT NOT NULL,
    sku VARCHAR(20) NOT NULL,
    qty INT NOT NULL,
    PRIMARY KEY(order_number, sku),
    FOREIGN KEY(order_number) REFERENCES package,
    FOREIGN KEY(sku) REFERENCES product,
    CONSTRAINT qty_positive CHECK (qty > 0)
);

CREATE TABLE delivery
(
    address VARCHAR(300) NOT NULL,
    tin NUMERIC(12) NOT NULL,
    PRIMARY KEY(address, tin),
    FOREIGN KEY(address) REFERENCES warehouse(address),
    FOREIGN KEY(tin) REFERENCES supplier(tin)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [350]:
%%sql
-- populate.sql

INSERT INTO customer VALUES (DEFAULT, 'Pedro', 'pedrofrigolet@gmail.com', '+351 912345678', 'Rua da Boa Nova nº39, Ermesinde, Porto, Portugal');
INSERT INTO customer VALUES (DEFAULT, 'Miguel', 'migueltavares@gmail.com', '+351 942069697', 'Travessa da Esperança nº14 2ºD, Rebordosa, Porto, Portugal');
INSERT INTO customer VALUES (DEFAULT, 'José', 'zedopipo@gmail.com', '+351 918008576', 'Rua do Técnico nº1, Pinhal Novo, Setúbal, Portugal');

INSERT INTO employee VALUES (10293847562, 201928376, '2000-06-15', 'João');
INSERT INTO employee VALUES (91827364503, 282736579, '2001-03-15', 'Carlos');
INSERT INTO employee VALUES (10243347562, 200923356, '2002-04-15', 'Marcos');

INSERT INTO department VALUES('Recursos Humanos');
INSERT INTO department VALUES('Logística');
INSERT INTO department VALUES('Comercial');

INSERT INTO workplace VALUES('Rua Cid Tomar 49, Palhais, Setúbal, 2830-573', 38.623246, -9.047482);
INSERT INTO workplace VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099', 38.705305, -9.377783);
INSERT INTO workplace VALUES('Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542', 38.770582, -9.287598);
INSERT INTO workplace VALUES('Av. Ten-Cel. Melo Antunes, Fafe, Braga, 4820-398', 41.454987, -8.178397);

INSERT INTO office VALUES('Rua Cid Tomar 49, Palhais, Setúbal, 2830-573');
INSERT INTO office VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099');

INSERT INTO warehouse VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099');
INSERT INTO warehouse VALUES('Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542');

INSERT INTO package VALUES(DEFAULT, 2, '2022-11-30');
INSERT INTO package VALUES(DEFAULT, 3, '2022-12-07');
INSERT INTO package VALUES(DEFAULT, 1, '2022-12-24');
INSERT INTO package VALUES(DEFAULT, 3, '2023-01-05');
INSERT INTO package VALUES(DEFAULT, 2, '2023-01-17');
INSERT INTO package VALUES(DEFAULT, 1, '2023-01-21');
INSERT INTO package VALUES(DEFAULT, 1, '2023-02-12');
INSERT INTO package VALUES(DEFAULT, 2, '2023-03-19');
INSERT INTO package VALUES(DEFAULT, 3, '2023-04-17');

INSERT INTO sale VALUES(2);
INSERT INTO sale VALUES(4);
INSERT INTO sale VALUES(5);
INSERT INTO sale VALUES(8);

INSERT INTO product VALUES('TS123456', 'Água Molhadinha, 50cl', 'Água mineral natural da Serra da Estrela. Com pH de 7.0, perfeita para a saude. Produto Nacional', 0.50);
INSERT INTO product VALUES('KS944RUR', 'Carregador Apple iPhone', 'Carregador lightning de 40W com fio de 40cm.', 90, 789870254652);
INSERT INTO product VALUES('KS93528TUT', 'Bolachas Oreo', 'Bolachas de chocolate com recheio de creme.', 1.50);
INSERT INTO product VALUES('KA17120203', 'Red Bull, 25cl', 'Bebida energética com cafeína, baixa em açúcar.', 2.50);
INSERT INTO product VALUES('HM21KMPW', 'Portátil Gaming ASUS Rog Strix', 'Intel Core i7, 32Gb Ram, RTX 4080, SSD NVMe 1Tb', 2389.99);
INSERT INTO product VALUES('X00299X9JF', 'Fortnite 1500 VBUCKS Gift Card', 'Código de acesso a 1500 VBUCKS. Compatível com Windows, Mac, iOS, Android, PlayStation, XBOX, Nintendo Switch.', 0.50);

INSERT INTO supplier VALUES(122365939, 'TS123456', 'Av. Santo Condestável, 1950-011 Lisboa', 'Molhadinha, Lda.', '2024-01-01');
INSERT INTO supplier VALUES(135238432, 'KS944RUR', 'Campo Pequeno, 1000-082 Lisboa', 'Apple', '2024-02-01');
INSERT INTO supplier VALUES(159438584, 'KS93528TUT', 'Praça Duque de Saldanha 1, 1050-094 Lisboa', 'Oreo', '2023-12-31');
INSERT INTO supplier VALUES(154294955, 'KA17120203', 'Av. da Liberdade 240 2º Esq, 1250-148 Lisboa', 'Red Bull', '2024-01-01');
INSERT INTO supplier VALUES(165439089, 'HM21KMPW', 'Praça Martim Moniz 39, 1150-052 Lisboa', 'ASUS', '2025-01-01');
INSERT INTO supplier VALUES(194355853, 'X00299X9JF', 'Rua do Grilo 84, 1950-144 Lisboa', 'Epic Games', '2024-12-31');

INSERT INTO works VALUES(10293847562, 'Logística', 'Rua Cid Tomar 49, Palhais, Setúbal, 2830-573');
INSERT INTO works VALUES(10293847562, 'Recursos Humanos', 'Avenida Lago 23, Cascais, Lisboa, 2765-099');
INSERT INTO works VALUES(91827364503, 'Comercial', 'Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542');
INSERT INTO works VALUES(10243347562, 'Logística', 'Av. Ten-Cel. Melo Antunes, Fafe, Braga, 4820-398');
INSERT INTO works VALUES(10243347562, 'Comercial', 'Rua Cid Tomar 49, Palhais, Setúbal, 2830-573');

INSERT INTO process VALUES(91827364503, 1);
INSERT INTO process VALUES(91827364503, 2);
INSERT INTO process VALUES(91827364503, 3);
INSERT INTO process VALUES(91827364503, 4);
INSERT INTO process VALUES(91827364503, 5);
INSERT INTO process VALUES(91827364503, 6);
INSERT INTO process VALUES(10243347562, 7);
INSERT INTO process VALUES(10243347562, 8);
INSERT INTO process VALUES(10243347562, 9);

INSERT INTO pay VALUES(3, 2);
INSERT INTO pay VALUES(3, 4);
INSERT INTO pay VALUES(2, 5);
INSERT INTO pay VALUES(2, 8);

INSERT INTO contains VALUES(1, 'TS123456', 16);
INSERT INTO contains VALUES(1, 'KA17120203', 3);
INSERT INTO contains VALUES(2, 'HM21KMPW', 1);
INSERT INTO contains VALUES(2, 'X00299X9JF', 3);
INSERT INTO contains VALUES(3, 'KS93528TUT', 1);
INSERT INTO contains VALUES(3, 'KA17120203', 1);
INSERT INTO contains VALUES(4, 'KA17120203', 40);
INSERT INTO contains VALUES(5, 'HM21KMPW', 2);
INSERT INTO contains VALUES(5, 'KS944RUR', 2);
INSERT INTO contains VALUES(6, 'KS944RUR', 1);
INSERT INTO contains VALUES(7, 'TS123456', 2);
INSERT INTO contains VALUES(7, 'KA17120203', 1);
INSERT INTO contains VALUES(7, 'KS93528TUT', 1);
INSERT INTO contains VALUES(8, 'HM21KMPW', 2);
INSERT INTO contains VALUES(9, 'X00299X9JF', 5);

INSERT INTO delivery VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099', '122365939');
INSERT INTO delivery VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099', '135238432');
INSERT INTO delivery VALUES('Avenida Lago 23, Cascais, Lisboa, 2765-099', '159438584');
INSERT INTO delivery VALUES('Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542', '154294955');
INSERT INTO delivery VALUES('Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542', '165439089');
INSERT INTO delivery VALUES('Rua Pé Mouro Armz 108, Sintra, Lisboa, 2735-542', '194355853');

*  postgresql://db:***@postgres/db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [333]:
%%sql
    
SELECT DISTINCT c.name
FROM (SELECT * FROM package WHERE order_date BETWEEN '2023-01-01' AND '2023-12-31') o
NATURAL JOIN contains
NATURAL JOIN (SELECT * FROM product WHERE price > 50) p
INNER JOIN customer c
    USING (customer_number);

*  postgresql://db:***@postgres/db
2 rows affected.

[('Miguel',), ('Pedro',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [334]:
%%sql

WITH w as (SELECT * FROM (employee INNER JOIN works USING (ssn) NATURAL JOIN workplace NATURAL JOIN warehouse)),
     of as (SELECT * FROM (employee INNER JOIN works USING (ssn) NATURAL JOIN workplace wp NATURAL JOIN office))

SELECT DISTINCT e.name
FROM (SELECT * FROM package WHERE order_date BETWEEN '2023-01-01' AND '2023-01-31') o
NATURAL JOIN process p
NATURAL JOIN (SELECT * FROM w EXCEPT SELECT * FROM of)e;

*  postgresql://db:***@postgres/db
1 rows affected.

[('Carlos',)]

3. Indique o nome do produto mais vendido;

In [335]:
%%sql

SELECT name
FROM product
NATURAL JOIN contains
NATURAL JOIN package
NATURAL JOIN sale
GROUP BY sku
HAVING SUM(qty) >= ALL (SELECT SUM(qty) FROM product NATURAL JOIN contains NATURAL JOIN package NATURAL JOIN sale GROUP BY sku);

*  postgresql://db:***@postgres/db
1 rows affected.

[('Red Bull, 25cl',)]

4. Indique o valor total de cada venda realizada.

In [342]:
%%sql

SELECT order_number,
       SUM(sub_total) AS total
FROM
    (SELECT 
        order_number,
        qty*price AS sub_total
    FROM sale
    NATURAL JOIN package
    NATURAL JOIN contains
    NATURAL JOIN product) a
GROUP BY order_number
ORDER BY order_number;

*  postgresql://db:***@postgres/db
4 rows affected.

[(2, Decimal('2391.49')),
 (4, Decimal('100.00')),
 (5, Decimal('4959.98')),
 (8, Decimal('4779.98'))]